In [2]:
import mysql.connector
import pandas as pd

# Database connection
mydb = mysql.connector.connect(host = "localhost",user = "ragu", password = "password")
cursor = mydb.cursor()

In [3]:
#Use Database joins
cursor.execute("use joins")

In [4]:
#List of Tables
cursor.execute("show tables")
for x in cursor:
    print(x)

('Iris_petal',)
('Iris_sepal',)
('Iris_species',)
('committees',)
('member',)

In [5]:
# Count
pd.read_sql_query("select count(*) from member",mydb)

   count(*)
0         5

In [8]:
# Count 
pd.read_sql_query("select name ,count(*) from member group by name ",mydb)

       name  count(*)
0      Ragu         1
1     Vicky         1
2  Thanigai         1
3      Deva         1
4     Jegan         1

In [ ]:
# Count
pd.read_sql_query("select ")